<?php

return [

    /*
    |----------------------------------------------------------------------
    | การตั้งค่า
    |----------------------------------------------------------------------
    |
    | ตั้งค่ามูลค่าตั้งต้นบางประการ โดยสามารถเพิ่มการตั้งค่าทั้งหมดที่สามารถตั้งได้ใน dompdf_config.inc.php
    | คุณสามารถเขียนทับไฟล์ config ทั้งหมดได้
    |
    */
    'show_warnings' => false,   // แสดงข้อผิดพลาดหากเกิดข้อผิดพลาดจาก dompdf

    'public_path' => null,  // สามารถเขียนทับ path สาธารณะได้หากจำเป็น

    /*
     * ฟอนต์ Dejavu Sans ขาด glyph สำหรับการแปลงสัญลักษณ์บางตัว เช่น € และ £
     * ปิดฟังก์ชันนี้หากต้องการแสดงสัญลักษณ์เหล่านี้
     */
    'convert_entities' => true,

    'options' => [
        /**
         * ตำแหน่งของไดเรกทอรีฟอนต์ของ DOMPDF
         *
         * ตำแหน่งของไดเรกทอรีที่ DOMPDF จะเก็บฟอนต์และข้อมูลฟอนต์
         * หมายเหตุ: ไดเรกทอรีนี้ต้องมีอยู่และสามารถเขียนได้โดยกระบวนการของเว็บเซิร์ฟเวอร์
         * โปรดสังเกตเครื่องหมายทับที่ท้าย
         */
        'font_dir' => storage_path('fonts'), // แนะนำโดย dompdf (https://github.com/dompdf/dompdf/pull/782)

        /**
         * ตำแหน่งของไดเรกทอรีแคชฟอนต์ของ DOMPDF
         *
         * ไดเรกทอรีนี้เก็บข้อมูลแคชฟอนต์สำหรับฟอนต์ที่ใช้ใน DOMPDF
         * ไดเรกทอรีนี้สามารถเป็นไดเรกทอรีเดียวกับ DOMPDF_FONT_DIR
         *
         * หมายเหตุ: ไดเรกทอรีนี้ต้องมีอยู่และสามารถเขียนได้โดยกระบวนการของเว็บเซิร์ฟเวอร์
         */
        'font_cache' => storage_path('fonts'),

        /**
         * ตำแหน่งของไดเรกทอรีชั่วคราว
         *
         * ไดเรกทอรีที่ระบุจะต้องสามารถเขียนได้โดยกระบวนการของเว็บเซิร์ฟเวอร์
         * ไดเรกทอรีนี้จำเป็นสำหรับการดาวน์โหลดภาพจากระยะไกลและเมื่อใช้ backend PDFLib
         */
        'temp_dir' => sys_get_temp_dir(),

        /**
         * ==== สำคัญ ====
         *
         * "chroot" ของ dompdf: ป้องกันไม่ให้ dompdf เข้าถึงไฟล์ระบบหรือไฟล์อื่น ๆ
         * บนเว็บเซิร์ฟเวอร์ ไฟล์ทั้งหมดที่ dompdf เปิดต้องอยู่ใน
         * ไดเรกทอรีที่อยู่ภายในไดเรกทอรีนี้ อย่าตั้งเป็น '/' เพราะจะเปิดช่องทาง
         * ให้ผู้โจมตีสามารถใช้ dompdf เพื่ออ่านไฟล์ทั้งหมดในเซิร์ฟเวอร์
         * ควรใช้เป็นพาธสัมบูรณ์
         * การตรวจสอบนี้จะเกิดขึ้นเมื่อเรียกใช้งานจาก command line เท่านั้น
         * แต่จะไม่เกิดขึ้นเมื่อใช้คลาสโดยตรง เช่น:
         * $dompdf = new DOMPDF();  $dompdf->load_html($htmldata); $dompdf->render(); $pdfdata = $dompdf->output();
         */
        'chroot' => realpath(base_path()),

        /**
         * รายชื่อโปรโตคอลที่อนุญาต
         *
         * โปรโตคอลและ PHP wrappers ที่อนุญาตใน URI และกฎการตรวจสอบ
         * ที่ใช้ในการโหลดทรัพยากร
         *
         * @var array
         */
        'allowed_protocols' => [
            'data://' => ['rules' => []],
            'file://' => ['rules' => []],
            'http://' => ['rules' => []],
            'https://' => ['rules' => []],
        ],

        /**
         * การตรวจสอบการใช้เส้นทางของไฟล์ผลลัพธ์ (ไฟล์บันทึก, ไฟล์ชั่วคราว)
         */
        'artifactPathValidation' => null,

        /**
         * @var string
         */
        'log_output_file' => null,

        /**
         * การเปิดใช้ font subsetting หรือไม่
         */
        'enable_font_subsetting' => false,

        /**
         * Backend การเรนเดอร์ PDF ที่ใช้
         *
         * ตัวเลือกที่ใช้ได้คือ 'PDFLib', 'CPDF' (คลาส PDF ของ R&OS), 'GD' และ
         * 'auto'. 'auto' จะค้นหา PDFLib และใช้ถ้าพบ หรือถ้าไม่พบจะ
         * ใช้ CPDF แทน. 'GD' เรนเดอร์ PDF เป็นไฟล์กราฟิก
         * {@link * Canvas_Factory} กำหนดว่าใช้คลาสเรนเดอร์ไหน
         * ตามการตั้งค่านี้
         */
        'pdf_backend' => 'CPDF',

        /**
         * มุมมองสื่อของ HTML ที่จะเรนเดอร์เป็น PDF
         * 
         * รายการประเภทและกฎการแยกวิเคราะห์สำหรับการขยายในอนาคต:
         * http://www.w3.org/TR/REC-html40/types.html
         *   screen, tty, tv, projection, handheld, print, braille, aural, all
         * หมายเหตุ: aural ถูกยกเลิกใน CSS 2.1 เพราะมันถูกแทนที่ด้วย speech ใน CSS 3.
         */
        'default_media_type' => 'screen',

        /**
         * ขนาดกระดาษเริ่มต้น
         *
         * ขนาดกระดาษมาตรฐานของอเมริกาเหนือคือ "letter"; ประเทศอื่นๆ ส่วนใหญ่ใช้ "a4"
         *
         * @see CPDF_Adapter::PAPER_SIZES สำหรับขนาดที่ใช้ได้ ('letter', 'legal', 'A4', ฯลฯ)
         */
        'default_paper_size' => 'a4',

        /**
         * ทิศทางของกระดาษเริ่มต้น
         *
         * ทิศทางของหน้ากระดาษ (แนวตั้งหรือแนวนอน)
         *
         * @var string
         */
        'default_paper_orientation' => 'portrait',

        /**
         * ฟอนต์เริ่มต้น
         *
         * ใช้หากไม่สามารถหาฟอนต์ที่เหมาะสมได้ ฟอนต์นี้ต้องมีอยู่ในโฟลเดอร์ฟอนต์
         *
         * @var string
         */
        'default_font' => 'THSarabunNew',

        /**
         * การตั้งค่า DPI ของภาพ
         *
         * การตั้งค่านี้กำหนด DPI ตั้งต้นสำหรับภาพและฟอนต์
         * สามารถปรับ DPI ของภาพในตัวได้โดยการกำหนด
         * ความกว้างและความสูงของภาพในสไตล์แอตทริบิวต์ของภาพ
         *
         * สำหรับการเรนเดอร์ของ DOMPDF, พิกเซลต่อนิ้ว (PPI) = จุดต่อนิ้ว (DPI)
         */
        'dpi' => 96,

        /**
         * เปิดใช้งาน PHP ที่ฝังตัว
         *
         * หากตั้งค่าตัวเลือกนี้เป็น true DOMPDF จะประมวลผล PHP ที่ฝังอยู่
         * ภายในแท็ก <script type="text/php"> ... </script>
         *
         * ==== สำคัญ ====
         * การเปิดใช้งานนี้สำหรับเอกสารที่คุณไม่ไว้ใจ (เช่น หน้า HTML จากแหล่งที่มาภายนอก)
         * อาจทำให้เกิดความเสี่ยงด้านความปลอดภัย
         * หากใช้เอกสารที่ไม่ได้เชื่อถือ อาจเกิดช่องโหว่ได้
         */
        'enable_php' => false,

        /**
         * เปิดใช้งาน JavaScript ภายใน
         *
         * หากตั้งค่าตัวเลือกนี้เป็น true DOMPDF จะเพิ่ม JavaScript ที่ฝังอยู่
         * ภายในแท็ก <script type="text/javascript"> ... </script> ลงใน PDF
         * หมายเหตุ: นี่คือ JavaScript ที่ใช้ใน PDF ที่จะถูกเรียกใช้งานใน PDF Viewer
         */
        'enable_javascript' => true,

        /**
         * เปิดใช้งานการเข้าถึงไฟล์ระยะไกล
         *
         * หากตั้งค่าตัวเลือกนี้เป็น true DOMPDF จะเข้าถึงเว็บไซต์ระยะไกล
         * สำหรับภาพและไฟล์ CSS ตามที่จำเป็น
         *
         * ==== สำคัญ ====
         * การเปิดใช้งานนี้อาจทำให้เกิดความเสี่ยงด้านความปลอดภัย
         */
        'enable_remote' => false,

        /**
         * รายชื่อโฮสต์ระยะไกลที่อนุญาต
         *
         * แต่ละค่าในอาร์เรย์ต้องเป็นโฮสต์เนมที่ถูกต้อง
         */
        'allowed_remote_hosts' => null,

        /**
         * อัตราส่วนที่ใช้กับความสูงของฟอนต์
         */
        'font_height_ratio' => 1.1,

        /**
         * ใช้ไลบรารี HTML5 parser
         *
         * @deprecated ฟีเจอร์นี้จะเปิดใช้งานเสมอใน dompdf 2.x
         *
         * @var bool
         */
        'enable_html5_parser' => true,
    ],

];